app/controllers/details_controller.rb

SELECT * FROM "details" WHERE ("details"."id" = 1)
---
  def show
    @detail = Detail.find(params[:id])

SELECT * FROM "details" WHERE ("details"."id" = 1)
---
  def edit
    @detail = Detail.find(params[:id])

INSERT INTO "details" ("created_at", "updated_at", "descrizione", "master_id") VALUES('2009-09-09 13:53:57', '2009-09-09 13:53:57', 'Dettaglio 1 di master 1', 1)
---
  def create
    @detail = Detail.new(params[:detail])

    respond_to do |format|
      if @detail.save

SELECT * FROM "details" WHERE ("details"."id" = 1)
---
  def update
    @detail = Detail.find(params[:id])

SELECT * FROM "details" WHERE ("details"."id" = 6)
DELETE FROM "details" WHERE "id" = 6
---
  def destroy
    @detail = Detail.find(params[:id])
    @detail.destroy