app/controllers/masters_controller.rb

SELECT * FROM "masters"
---
  def index
    @masters = Master.all

SELECT * FROM "masters" WHERE ("masters"."id" = 1)
---
  def show
    @master = Master.find(params[:id])

SELECT * FROM "masters" WHERE ("masters"."id" = 1)
---
  def edit
    @master = Master.find(params[:id])

INSERT INTO "masters" ("created_at", "updated_at", "descrizione") VALUES('2009-09-09 13:53:23', '2009-09-09 13:53:23', 'Master numero 1')
---
  def create
    @master = Master.new(params[:master])

    respond_to do |format|
      if @master.save